## Plan Result (ptl_finops_reporting - TerraformPlanApply)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.finopslogicapp-la-hmctsnonprod[0]
  * azurerm_role_assignment.finopslogicapp-la-hmctsqa[0]
* Update
  * azurerm_logic_app_workflow.finopslogicapp[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.finopslogicapp[0] will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "finopslogicapp" {
        id                                 = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Logic/workflows/finopsdataptllogicapp"
        name                               = "finopsdataptllogicapp"
      ~ parameters                         = {
          - "$connections" = jsonencode(
                {
                  - azureblob        = {
                      - connectionId         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Web/connections/azureblob"
                      - connectionName       = "azureblob"
                      - connectionProperties = {
                          - authentication = {
                              - identity = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-ptl-mi"
                              - type     = "ManagedServiceIdentity"
                            }
                        }
                      - id                   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/azureblob"
                    }
                  - azuremonitorlogs = {
                      - connectionId         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.Web/connections/azuremonitorlogs"
                      - connectionName       = "azuremonitorlogs"
                      - connectionProperties = {
                          - authentication = {
                              - identity = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/finopsdataptlrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-ptl-mi"
                              - type     = "ManagedServiceIdentity"
                            }
                        }
                      - id                   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/azuremonitorlogs"
                    }
                }
            ) -> null
        }
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/finops-reporting"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      ~ workflow_parameters                = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.finopslogicapp-la-hmctsnonprod[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-la-hmctsnonprod" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "597b4d17-2d84-4c6d-8806-c55e1a5c6f18"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.finopslogicapp-la-hmctsqa[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-la-hmctsqa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "597b4d17-2d84-4c6d-8806-c55e1a5c6f18"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-qa"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label ptl_finops_reporting - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/finops-reporting/issues/18/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"ptl_finops_reporting - TerraformPlanApply","Vars":{}} -->